crathje/ESP32_A1S_Radio/src/main.cpp
void setVolume(int value)
{
  // Serial.printf("Volume set to: %d\r\n", value);
  if (value > 100)
  {
    value = 100;
  }
  if (value < 0)
  {
    value = 0;
  }

  volume = value;
#ifdef DAC2USE_ES8388
  dac.volume(ES8388::ES_MAIN, value);
  dac.volume(ES8388::ES_OUT1, value);
  dac.volume(ES8388::ES_OUT2, value);
  dac.mute(ES8388::ES_OUT1, false);
  dac.mute(ES8388::ES_OUT2, false);
  dac.mute(ES8388::ES_MAIN, false);
#endif

#ifdef DAC2USE_AC101
  dac.SetVolumeSpeaker(value);
  dac.SetVolumeHeadphone(value);
#endif

  asyncWebSocket.textAll("V\t" + String(volume));
  drawDisplay();
}

void actionPlayPause() { audio.pauseResume(); }
void actionVolumeUp() { setVolume(volume + 1); }
void actionVolumeDown() { setVolume(volume - 1); }

void actionUpdateStarting()
{
  digitalWrite(GPIO_PA_EN, LOW);
// mute!
#ifdef DAC2USE_ES8388
  dac.mute(ES8388::ES_OUT1, true);
  dac.mute(ES8388::ES_OUT2, true);
  dac.mute(ES8388::ES_MAIN, true);
#endif
  audio.stopSong();

  if (foundDisplay)
  {
    display.clearDisplay();
    display.setTextColor(WHITE);
    display.setTextSize(2);
    display.setCursor(0, 0);
    display.println("Updating");
    display.display();
  }
}

// void buttonClick(Button2 &btn)
// {
//   if (btn == button4)
//   {
//   }
//   // else if (btn == button5)
//   // {
//   //   actionPlayPause();
//   // }
//   // else if (btn == button6)
//   // {
//   //   actionVolumeUp();
//   // }
// }

void playUrl(const char *url)
{
  audio_showstreamtitle("");
  lastPlayedStation[0] = 0;

  JsonArray array = configJSON["stations"].as<JsonArray>();
  int i = 0;
  currentStationNum = -1;
  for (JsonVariant v : array)
  {
    if (!strncmp(url, v["url"].as<String>().c_str(), strlen(url)))
    {
      // Serial.print("FOUND::: ");
      currentStationNum = i;
      sprintf(lastPlayedStation, "%s", v["name"].as<String>().c_str());
    }
    // Serial.println(v.as<string>().c_str());
    i++;
  }

  String surl = String(url);
  if (strlen(lastPlayedStation) == 0)
  {
    sprintf(lastPlayedStation, "%s", surl.substring(surl.lastIndexOf("/") + 1).c_str());
  }
  audio_showstation(lastPlayedStation);
  strcpy(lastPlayedUrl, url);
  asyncWebSocket.textAll("C\t" + String(url));
  audio.connecttohost(url);
}

void changeSationIndex(int newIndex)
{
  if (currentStationNum == newIndex)
  {
    return;
  }
  JsonArray array = configJSON["stations"].as<JsonArray>();
  int i = 0;
  for (JsonVariant v : array)
  {
    if (i == newIndex)
    {
      currentStationNum = newIndex;
      playUrl(v["url"].as<String>().c_str());
      return;
    }
    i++;
  }
  // not found, not changing anything
}

void setup()
{
  Serial.begin(115200);
  Serial.println("\r\nReset");

  uint64_t chipid = ESP.getEfuseMac(); // The chip ID is essentially its MAC
                                       // address(length: 6 bytes).
  Serial.println(F("===== CHIP INFO ====="));
  Serial.printf_P(PSTR("ChipID:            %04X%08X\r\n"),
                  (uint16_t)(chipid >> 32), (uint32_t)chipid);
  Serial.printf_P(PSTR("ChipCores:         %d\r\n"), ESP.getChipCores());
  Serial.printf_P(PSTR("CpuFreqMHz:        %3d\r\n"), ESP.getCpuFreqMHz());
  Serial.printf_P(PSTR("ChipRevision:      %d\r\n"), ESP.getChipRevision());
  Serial.printf_P(PSTR("FreeHeap:          %3d\r\n"), ESP.getFreeHeap());
  Serial.printf_P(PSTR("CycleCount:        %3d\r\n"), ESP.getCycleCount());
  Serial.printf_P(PSTR("SdkVersion:        %s\r\n"), ESP.getSdkVersion());
  Serial.printf_P(PSTR("FlashChipSize:     %3d\r\n"), ESP.getFlashChipSize());
  // DebugHWSerial.printf("FlashChipRealSize: %3d\n"),
  // ESP.getFlashChipRealSize());
  Serial.printf_P(PSTR("FlashChipSpeed:    %3d\r\n"), ESP.getFlashChipSpeed());
  Serial.printf_P(PSTR("FlashChipMode:     %d\r\n"), ESP.getFlashChipMode());
  Serial.printf_P(PSTR("SketchSize:        %d\r\n"), ESP.getSketchSize());
  Serial.printf_P(PSTR("FreeSketchSpace:   %d\r\n"), ESP.getFreeSketchSpace());
  Serial.printf_P(PSTR("ArduinoStack:      %d\r\n"),
                  getArduinoLoopTaskStackSize());
  Serial.printf_P(PSTR("ArduinoVersion:    %d.%d.%d\r\n"),
                  ESP_ARDUINO_VERSION_MAJOR, ESP_ARDUINO_VERSION_MINOR,
                  ESP_ARDUINO_VERSION_PATCH);

  // pinMode(BUTTON_3_PIN, INPUT_PULLUP);
  // pinMode(BUTTON_4_PIN, INPUT_PULLUP);
  // pinMode(BUTTON_5_PIN, INPUT_PULLUP);
  // pinMode(BUTTON_6_PIN, INPUT_PULLUP);

  // button3.begin(BUTTON_3_PIN);
  // button3.setClickHandler(buttonClick);
  // button4.begin(BUTTON_4_PIN);
  // button4.setClickHandler(buttonClick);
  // button5.begin(BUTTON_5_PIN);
  // button5.setClickHandler(buttonClick);
  // button6.begin(BUTTON_6_PIN);
  // button6.setClickHandler(buttonClick);

  loadConfigFromFlash();

  if (configJSON["volume"].is<int>())
  {
    volume = configJSON["volume"].as<int>();
  }

  pinMode(SD_CS, OUTPUT);
  digitalWrite(SD_CS, HIGH);
  SPI.begin(SPI_SCK, SPI_MISO, SPI_MOSI);
  SPI.setFrequency(1000000);

  Serial.println(F("===== SD CARD INFO ====="));
  if (SD.begin(SD_CS))
  {
    Serial.printf_P(PSTR("cardType:   %d\r\n"), SD.cardType());
    Serial.printf_P(PSTR("cardSize:   %lld\r\n"), SD.cardSize());
    Serial.printf_P(PSTR("totalBytes: %lld\r\n"), SD.totalBytes());
    Serial.printf_P(PSTR("usedBytes:  %lld\r\n"), SD.usedBytes());
  }
  else
  {
    Serial.println(F("SD Init failed."));
  }

  AsyncWiFiManager wifiManager(&asyncWebServer, &dnsServer);
  sprintf(hostname, "A1S-Radio-%04X%08X", (uint16_t)(chipid >> 32),
          (uint32_t)chipid);
  WiFi.setHostname(hostname);
  wifiManager.autoConnect(hostname, NULL);

  DefaultHeaders::Instance().addHeader("Access-Control-Allow-Headers", "*");
  DefaultHeaders::Instance().addHeader("Access-Control-Allow-Origin", "*");
  DefaultHeaders::Instance().addHeader("Access-Control-Allow-Methods", "GET, POST, PUT");
  DefaultHeaders::Instance().addHeader("Access-Control-Allow-Headers", "Content-Type");

  asyncWebServer.on("/", HTTP_GET, [](AsyncWebServerRequest *request)
                    { request->send_P(200, "text/html", index_html); });
  asyncWebServer.on("/config.json", HTTP_GET, [](AsyncWebServerRequest *request)
                    {
    AsyncResponseStream *response = request->beginResponseStream("application/json");
    // JsonObject root = configJSON.to<JsonObject>();
    serializeJsonPretty(configJSON, *response);
    request->send(response); });
  asyncWebServer.on("/config.json", HTTP_POST, [](AsyncWebServerRequest *request)
                    {
                int params = request->params();
                for (int i = 0; i < params; i++) {
                  const AsyncWebParameter* p = request->getParam(i);
                  Serial.printf("POST[%s]: %s\n", p->name().c_str(), p->value().c_str());
                  if (p->name() == "config") {
                    // if (validateJson(p->value())) {
                      DeserializationError dret = deserializeJson(configJSON, p->value());
                      if (dret == DeserializationError::Ok) {
                        if (LittleFS.begin(true)) {                            
                          File file = LittleFS.open(CONFIGFILENAME, "w", true);
                          if (file)
                          {
                            serializeJson(configJSON, file);
                            file.close();
                            Serial.println("Config has been saved");
                          }
                          request->redirect("/config");
                          LittleFS.end();
                          return;
                        } else {
                          request->send_P(500, "text/html", "Could not mount LittleFS");
                          return;
                        }
                      }
                    // } 
                  }
                }
                request->send_P(500, "text/html", "Failed"); });
  asyncWebServer.on("/config", HTTP_GET, [](AsyncWebServerRequest *request)
                    { 
                char json[_MAX_JSONBUFFERSIZE];
                serializeJsonPretty(configJSON, json);
                request->send(200, "text/html", String() + "<html><body><form action=\"/config.json\" method=\"POST\"><textarea name=\"config\" cols=\"100\" rows=\"35\">" + json + "</textarea><br /><button>Save</button></form></body></html>"); });

  asyncWebServer.on("/playpause", HTTP_GET, [](AsyncWebServerRequest *request)
                    {
    request->send(200, "text/plain", "OK");
    actionPlayPause(); });
  asyncWebServer.on("/playurl", HTTP_GET, [](AsyncWebServerRequest *request)
                    {
    if (request->hasParam("playurl")) {
      String url = request->getParam("playurl")->value();
      playUrl(url.c_str());
      request->send(200, "text/plain", "OK");
      return;
    }
    request->send(200, "text/plain", "FAILED"); });
  asyncWebServer.on("/volup", HTTP_GET, [](AsyncWebServerRequest *request)
                    {
    request->send(200, "text/plain", "OK");
    actionVolumeUp(); });
  asyncWebServer.on("/voldown", HTTP_GET, [](AsyncWebServerRequest *request)
                    {
    request->send(200, "text/plain", "OK");
    actionVolumeDown(); });

  asyncWebServer.on("/data.json", HTTP_GET, [](AsyncWebServerRequest *request)
                    {
                      JsonDocument responseJson;
                      // responseJson["lastPlayedUrl"] = lastPlayedUrl;
                      responseJson["lastPlayedStation"] = lastPlayedStation;
                      responseJson["rssi"] = WiFi.RSSI();
                      responseJson["hostname"] = WiFi.getHostname();
                      responseJson["SSID"] = WiFi.SSID();
                      responseJson["compile_date"] = compile_date;
                      responseJson["sdk_version"] = ESP.getSdkVersion();
                      responseJson["FreeHeap"] = ESP.getFreeHeap();
                      responseJson["MinFreeHeap"] = ESP.getMinFreeHeap();
                      responseJson["FreeSketchSpace"] = ESP.getFreeSketchSpace();
#ifdef BOARD_HAS_PSRAM
                      responseJson["FreePsram"] = ESP.getFreePsram();
                      responseJson["MinFreePsram"] = ESP.getMinFreePsram();
#endif
                      responseJson["DAC"] = DACNAME;
                      responseJson["PIO_ENV"] = PIO_ENV;
                      responseJson["uptime"] = millis();
                      AsyncResponseStream *response = request->beginResponseStream("application/json");
                      serializeJsonPretty(responseJson, *response);
                      request->send(response); });

  asyncWebSocket.onEvent(onWebSocketEvent);
  asyncWebServer.addHandler(&asyncWebSocket);

  asyncWebServer.begin();

