crathje/ESP32_A1S_Radio/src/main.cpp
  String infoStr(info);
  infoStr.toLowerCase();
  if (infoStr.startsWith("streamurl="))
  {
    asyncWebSocket.textAll("AINF\t" + String(info));

    // experimental fetching of audio data like radio rock norge does not encapsulate the data into the stream
    // audio_info("StreamUrl='https://listenapi.planetradio.co.uk/api9.2/eventdata/292929585'");
    if (1 == 1)
    {
      String url = String(info + 11);
      url = url.substring(0, url.length() - 1);
      // Serial.print("Trying to get audio meta data from: ");
      // Serial.println(url.c_str());

      HTTPClient http;
      // WiFiClient newClient;
      if (http.begin(url))
      {
        int httpCode = http.GET();
        if (httpCode > 0)
        {
          // HTTP header has been send and Server response header has been handled
          // Serial.printf("[HTTP] GET... code: %d\n", httpCode);

          // file found at server
          if (httpCode == HTTP_CODE_OK)
          {
            String payload = http.getString();
            // Serial.println(payload);
            JsonDocument doc;
            DeserializationError derr = deserializeJson(doc, payload);
            if (derr == DeserializationError::Ok)
            {
              if (doc["eventType"].is<String>() && doc["eventSongArtist"].is<String>() && doc["eventSongTitle"].is<String>())
              {
                if (doc["eventType"].as<String>() == "Song")
                {
                  // Serial.println(doc["eventType"].as<String>());
                  // Serial.println(doc["eventSongArtist"].as<String>());
                  // Serial.println(doc["eventSongTitle"].as<String>());
                  sprintf(lastPlayedStreamTitle, "%s - %s", doc["eventSongArtist"].as<String>().c_str(), doc["eventSongTitle"].as<String>().c_str());
                  // Serial.println(lastPlayedStreamTitle);
                  audio_showstreamtitle(lastPlayedStreamTitle);
                }
                else
                {
                  Serial.printf("eventType is not Song...\r\n");
                }
              }
              else
              {
                Serial.printf("eventType || eventSongArtist || eventSongTitle not set\r\n");
              }
            }
            else
            {
              Serial.printf("DeserializationError: %d\r\n", derr);
            }
          }
        }
        else
        {
          Serial.printf("[HTTP] GET... failed, error: %s\n", http.errorToString(httpCode).c_str());
        }
      }
      else
      {
        Serial.printf("[HTTP] begin... failed\r\n");
      }
    }
  }
}
void audio_id3data(const char *info)
{ // id3 metadata
  Serial.print("id3data     ");
  Serial.println(info);

  asyncWebSocket.textAll("AID3\t" + String(info));
}
void audio_eof_mp3(const char *info)
{ // end of file
  Serial.print("eof_mp3     ");
  Serial.println(info);

  asyncWebSocket.textAll("AEM3\t" + String(info));
}
void audio_showstation(const char *info)
{
  Serial.print("station     ");
  Serial.println(info);
  strncpy(lastPlayedStation, info, sizeof(lastPlayedStation));
  asyncWebSocket.textAll("ASTA\t" + String(lastPlayedStation));

  drawDisplay();
}
void audio_showstreamtitle(const char *info)
{
  Serial.print("streamtitle ");
  Serial.println(info);
  strncpy(lastPlayedStreamTitle, info, sizeof(lastPlayedStreamTitle));
  asyncWebSocket.textAll("ASTT\t" + String(lastPlayedStreamTitle));

  drawDisplay();
}
void audio_bitrate(const char *info)
{
  Serial.print("bitrate     ");
  Serial.println(info);
}
void audio_commercial(const char *info)
{ // duration in sec
  Serial.print("commercial  ");
  Serial.println(info);
}
void audio_icyurl(const char *info)
{ // homepage
  Serial.print("icyurl      ");
  Serial.println(info);
}
void audio_lasthost(const char *info)
{ // stream URL played
  Serial.print("lasthost    ");
  Serial.println(info);
}
void audio_eof_speech(const char *info)
{
  Serial.print("eof_speech  ");
  Serial.println(info);
}